## Debug and get the desired results

### 1.Create two data frames using the following two Dicts, Merge two data frames, and append the second data frame as a new column to the first data frame.

In [2]:
# Two dataframes given

Car_Price = {'Company': ['Toyota', 'Honda', 'BMV', 'Audi'], 'Price': [23845, 17995, 135925 , 71400]}

car_Horsepower = {'Company': ['Toyota', 'Honda', 'BMV', 'Audi'], 'horsepower': [141, 80, 182 , 160]}

In [15]:
# Solution code
import pandas as pd
Car_P=pd.DataFrame(Car_Price)
Car_P
Car_H=pd.DataFrame(car_Horsepower)
Car_H
df=pd.merge(Car_P,Car_H,how='inner',left_on=['Company'],right_on=['Company'])
df

  Company   Price  horsepower
0  Toyota   23845         141
1   Honda   17995          80
2     BMV  135925         182
3    Audi   71400         160

### 2.Read a dataset of movie reviewers by modifying the parameters as required. The expected output is shown below.

In [10]:
# desired output

   user_id  age gender  occupation zip_code
0        1   24      M  technician    85711
1        2   53      F       other    94043
2        3   23      M      writer    32067
3        4   24      M  technician    43537
4        5   33      F       other    15213

In [11]:
import pandas as pd

# columns to be used
user_cols = ['user_id', 'age', 'gender', 'occupation', 'zip_code']

# reading the data
users = pd.read_table('http://bit.ly/movieusers')

users.head()

   1|24|M|technician|85711
0       2|53|F|other|94043
1      3|23|M|writer|32067
2  4|24|M|technician|43537
3       5|33|F|other|15213
4   6|42|M|executive|98101

In [29]:
# Solution code
import pandas as pd

# columns to be used
user_cols = ['user_id', 'age', 'gender', 'occupation', 'zip_code']

# reading the data
users = pd.read_table('http://bit.ly/movieusers',sep='|', delimiter=None)
users.columns=user_cols

users.head()

   user_id  age gender  occupation zip_code
0        2   53      F       other    94043
1        3   23      M      writer    32067
2        4   24      M  technician    43537
3        5   33      F       other    15213
4        6   42      M   executive    98101

### 3.Read the data and create a subset dataframe of movies with a rating of 9 or above in the crime genre.

In [ ]:
# read a dataset of top-rated IMDb movies into a DataFrame
movies = pd.read_table('http://bit.ly/imdbratings')
print(movies.head())

# Applying the required condition
movies[movies['genre'] = 'Crime' and movies['star_rating'] > 9]

In [31]:
# Solution code
movies = pd.read_table('http://bit.ly/imdbratings',sep=",")
print(movies.head())

# Applying the required condition
a=movies[(movies['genre'] == 'Crime') & (movies['star_rating'] > 9)]

   star_rating                     title content_rating   genre  duration  \
0          9.3  The Shawshank Redemption              R   Crime       142
1          9.2             The Godfather              R   Crime       175
2          9.1    The Godfather: Part II              R   Crime       200
3          9.0           The Dark Knight          PG-13  Action       152
4          8.9              Pulp Fiction              R   Crime       154

                                         actors_list
0  [u'Tim Robbins', u'Morgan Freeman', u'Bob Gunt...
1    [u'Marlon Brando', u'Al Pacino', u'James Caan']
2  [u'Al Pacino', u'Robert De Niro', u'Robert Duv...
3  [u'Christian Bale', u'Heath Ledger', u'Aaron E...
4  [u'John Travolta', u'Uma Thurman', u'Samuel L....